Бух_тест/src/InformationRegisters/РезультатыОбработкиРазрешенийНаИспользованиеВнешнихРесурсов/РезультатыОбработкиРазрешенийНаИспользованиеВнешнихРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыОбработкиРазрешенийНаИспользованиеВнешнихРесурсов</name>
  <attributes>
    <name>РезультатОбработки</name>
    <type>
      <types>EnumRef.РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_тест/src/InformationRegisters/РезультатыОбработкиРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных/РезультатыОбработкиРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыОбработкиРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных</name>
  <attributes>
    <name>РезультатОбработки</name>
    <type>
      <types>EnumRef.РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бух_тест/src/Enums/РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса/РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса</name>
  <enumValues>
    <name>ЗапросОдобрен</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтклонен</name>
  </enumValues>
</mdclass:Enum>

Бух_тест/src/CommonModules/СообщенияКонтрольУправленияРазрешениямиРеализация/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБЩАЯ РЕАЛИЗАЦИЯ ОБРАБОТКИ СООБЩЕНИЙ УДАЛЕННОГО АДМИНИСТРИРОВАНИЯ
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// {http://www.1c.ru/1cFresh/Application/Permissions/Control/a.b.c.d}InfoBasePermissionsRequestProcessed
//
// Параметры:
//  ИдентификаторЗапроса - УникальныйИдентификатор - идентификатор запроса на использование внешних ресурсов.
//  РезультатОбработки - ПеречислениеСсылка.РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса,
//  ИнформацияОбОшибке - ОбъектXDTO {http://www.1c.ru/SaaS/ServiceCommon}ErrorDescription.
//
Процедура ОбработанЗапросНеразделенногоСеанса(Знач ИдентификаторЗапроса, Знач РезультатОбработки, Знач ИнформацияОбОшибке) Экспорт
	
	Менеджер = РегистрыСведений.РезультатыОбработкиРазрешенийНаИспользованиеВнешнихРесурсов.СоздатьМенеджерЗаписи();
	
	Менеджер.ИдентификаторЗапроса = ИдентификаторЗапроса;
	Менеджер.РезультатОбработки = РезультатОбработки;
	Менеджер.ИнформацияОбОшибке = ИнформацияОбОшибке.BriefErrorDescription;
	
	Менеджер.Записать();
	
	Если РезультатОбработки = Перечисления.РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса.ЗапросОдобрен Тогда
		
		РаботаВБезопасномРежимеСлужебный.ПослеОбработкиЗапросов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЗапроса));
		
	КонецЕсли;
	
КонецПроцедуры

// {http://www.1c.ru/1cFresh/Application/Permissions/Control/a.b.c.d}ApplicationPermissionsRequestProcessed
//
// Параметры:
//  ИдентификаторЗапроса - УникальныйИдентификатор - идентификатор запроса на использование внешних ресурсов.
//  РезультатОбработки - ПеречислениеСсылка.РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса,
//  ИнформацияОбОшибке - ОбъектXDTO {http://www.1c.ru/SaaS/ServiceCommon}ErrorDescription.
//
Процедура ОбработанЗапросРазделенногоСеанса(Знач ИдентификаторЗапроса, Знач РезультатОбработки, Знач ИнформацияОбОшибке) Экспорт
	
	Менеджер = РегистрыСведений.РезультатыОбработкиРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных.СоздатьМенеджерЗаписи();
	
	Менеджер.ИдентификаторЗапроса = ИдентификаторЗапроса;
	Менеджер.РезультатОбработки = РезультатОбработки;
	Менеджер.ИнформацияОбОшибке = ИнформацияОбОшибке.BriefErrorDescription;
	
	Менеджер.Записать();
	
	Если РезультатОбработки = Перечисления.РезультатыОбработкиЗапросовНаИспользованиеВнешнихРесурсовВМоделиСервиса.ЗапросОдобрен Тогда
		
		РаботаВБезопасномРежимеСлужебный.ПослеОбработкиЗапросов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторЗапроса));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
